blogs/nc-and-curl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>nc 和 curl</title>
<!-- 2016-03-09 三 12:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">nc 和 curl</h1>
<p>
nc和curl是做IT必知必会的，一个用于tcp，一个用于http。这里记录一些使用经验和踩过的坑。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> curl</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 参数部分</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> -X</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<code>-X</code> 指定HTTP方法，常用的是<code>GET POST PUT DELETE</code> ，如果不指定，默认是<code>GET</code> 。如果指定了<code>-d</code> 参数（或者类似&#x2013;data-binary之类），则是<code>POST</code> ，如果现实指定了<code>-X POST</code> ，则需要<code>-d</code> 或类似的参数。
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> -H</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
指定请求的Header，通常指定Host，Cookie之类。例如： <code>-H 'Host: www.test.com'</code> 。当我们POST数据的时候，如果数据比较大，curl可能自动加上<code>Expect: 100-continue</code> ，如果服务端不支持这个Header，需要手动禁掉，方法是传递一个空Header <code>-H 'Expect:'</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> -d</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<code>-d</code> 参数用于 <code>PUT</code> 或者 <code>POST</code> 的请求Body，如果没有<code>-H</code> 指定Header，那么默认是 <code>application/x-www-form-urlencoded</code>
例如 <code>-d 'data you want post'</code> 请求body是 <code>data you want post</code> 更常见的形式是 <code>-d 'name=foo&amp;age=18'</code> 这种querystring的形式。如果数据存在文件里，使用<code>-d '@/path/to/file'</code> ，这里把文件<code>/path/to/file</code>的内容作为Body。
</p>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> &#x2013;data-binary</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
名字具有误导性，和二进制无关，作用和 <code>-d</code> 参数相同，只有一点 <code>-d</code> 参数指定文件作为上传内容时，curl会过滤换行（也可能还有别的），所以如果希望服务端读到和上传内容一样的数据，用<code>--data-binary</code> ，此时你可能需要用<code>-H</code> 指定<code>Content-Type</code> 。
</p>
</div>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> -vv</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
用于查看请求过程，包括连接的IP，请求的方法、URL、Header，响应的状态码、Header，这个是输出到标准输出的。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 请求Header</h3>
<div class="outline-text-3" id="text-1-2">
<p>
通过查看请求Header，可以知道我们指定的参数是否正确，请求是否正确。例如：Content-Length 可以知道发送的数据大小对不对。很多Header做测试很方便。
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Host</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
请求的Host，如果请求的URL中地址是IP，可能需要指定Host。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Content-Type</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
请求的内容类型，规范的程序中，这个很关键，因为服务端根据Content-Type解析收到的数据。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Content-Length</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
请求的数据长度
</p>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Accept</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
客户端接收什么Content-Type的数据，服务端根据客户端的能力，来返回不同的数据。例如 <code>Accept: text/html,image/webp</code> 中的webp表明客户端接收webp格式的图片，就可以返回图片的webp形式，节省带宽。如果Accept中没有这个，服务端可能就返回jpg的了。可以用来测试服务端。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Accept-Encoding</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
客户端接收的数据压缩格式。可以测试服务端配置的压缩是否生效，也可以服务端用来探测客户端能力。例如 <code>Accept-Encoding:gzip, deflate, sdch</code> 中表明客户端接收gzip压缩、sdch压缩。sdch压缩时google发明的，可能只有chrome浏览器支持。服务端可以根据这些数据，判断返回数据是否压缩，以什么格式压缩。
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2016-03-09 三 12:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
